In [1]:
import pandas as pd
import numpy as np

In [2]:
index = [('California', 2000),
        ('California', 2010),
        ('New York', 2000),
        ('New York', 2010), 
        ('Texas', 2000),
        ('Texas', 2010)]

populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

In [3]:
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [4]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [5]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [6]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [7]:
pop['California', 2010]

37253956

In [8]:
pop['California':'New York']

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [10]:
pop[pop > 22000000]

California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [11]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]], names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']], names=['subject', 'type'])

data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      26.0  37.1  28.0  38.1  34.0  37.9
     2      27.0  35.3  29.0  36.9  26.0  35.9
2014 1      51.0  37.4  36.0  36.8  38.0  37.4
     2      46.0  37.6  23.0  36.5  46.0  37.4

In [13]:
health_data['Guido', 'HR']

year  visit
2013  1        28.0
      2        29.0
2014  1        36.0
      2        23.0
Name: (Guido, HR), dtype: float64

In [15]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      26.0  37.1
     2      27.0  35.3

In [17]:
health_data.loc[2013, 'Bob']

type     HR  Temp
visit
1      26.0  37.1
2      27.0  35.3

In [19]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        26.0
      2        27.0
2014  1        51.0
      2        46.0
Name: (Bob, HR), dtype: float64

In [20]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      26.0  28.0  34.0
2014 1      51.0  36.0  38.0

In [21]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [22]:
pop.unstack(level=0)

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [23]:
pop.unstack(level=1)

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [24]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [25]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [26]:
pop.index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [27]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [28]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [29]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [30]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      26.0  37.1  28.0  38.1  34.0  37.9
     2      27.0  35.3  29.0  36.9  26.0  35.9
2014 1      51.0  37.4  36.0  36.8  38.0  37.4
     2      46.0  37.6  23.0  36.5  46.0  37.4

In [31]:
data_mean = health_data.mean(level='year')
data_mean

/tmp/ipykernel_4759/2845460446.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean = health_data.mean(level='year')

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR  Temp
year
2013     26.5  36.2  28.5  37.50  30.0  36.9
2014     48.5  37.5  29.5  36.65  42.0  37.4

In [33]:
data_mean.mean(axis=1, level='type')

/tmp/ipykernel_4759/1641729190.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  28.333333  36.866667
2014  40.000000  37.183333